# Дано число обозначающее день недели . Выести его название и указать яляется ли он выходным

d = int(input('Ввести день недели '))
if d == 1:
    print ('Понедельник(будний день)')
if d == 2:
    print ('Вторник(будний день)')
if d == 3:
    print ('Среда(будний день)')
if d == 4:
    print ('Четверг(будний день)')
if d == 5:
    print ('Пятница(будний день)')
if d == 6:
    print ('Суббота(выходной день)')
if d == 7:
    print ('Воскресенье(выходной день)')                    